[{"url": "https://en.wikipedia.org/wiki/List_of_historic_Indian_texts", "paragraph": "This article attempts to capture in one place the names of books and other works written in ancient India. For the purpose of this list, we consider all books written in India up to and including the Mughal era as being 'ancient books'."}, {"url": "https://en.wikipedia.org/wiki/Events_of_National_Historic_Significance", "paragraph": "Events of National Historic Significance  (also called National Historic Events) (French: Les événements d'importance historique nationale) are events that have been designated by Canada's Minister of the Environment, on the advice of the national Historic Sites and Monuments Board, as being defining actions, episodes, movements or experiences in Canadian history.[1]  To be designated, an event must have occurred at least 40 years previous; events that continue into the more recent past are evaluated on the basis of what occurred at least 40 years ago.[2]  As of October 2018, there were 485 designated Events of National Historic Significance.[3][4][5][6]"}, {"url": "https://en.wikipedia.org/wiki/Indian_Village,_Detroit", "paragraph": "Indian Village is a historic, affluent neighborhood located on Detroit's east side, bound to the north and south by Mack Avenue and East Jefferson Avenue, respectively, along the streets of Burns, Iroquois, and Seminole.[2] The district was listed on the National Register of Historic Places in 1972.[1]"}, {"url": "https://en.wikipedia.org/wiki/History_of_India", "paragraph": "According to consensus in modern genetics, anatomically modern humans first arrived on the Indian subcontinent from Africa between 73,000 and 55,000 years ago.[1]  However, the earliest known human remains in South Asia date to 30,000 years ago.  Settled life, which involves the transition from foraging to farming and pastoralism, began in South Asia around 7,000 BCE.  At the site of Mehrgarh presence can be documented of the domestication of wheat and barley, rapidly followed by that of goats, sheep, and cattle.[2] By 4,500 BCE, settled life had spread more widely,[2] and began to gradually evolve into the Indus Valley Civilization, an early civilization of the Old world, which was contemporaneous with Ancient Egypt and Mesopotamia. This civilisation flourished between 2,500 BCE and 1900 BCE in what today is Pakistan and north-western India, and was noted for its urban planning, baked brick houses, elaborate drainage, and water supply.[3]"}, {"url": "https://en.wikipedia.org/wiki/Indian_Summers", "paragraph": "Indian Summers is a British drama television series that began airing on Channel 4 on 15 February 2015.[1][2] The show details the events of summers spent at Simla, in the foothills of the Himalayas, by a group of the British governing and trading community at the time of the British Raj. The first series is set in 1932. It was broadcast in several countries subsequently."}, {"url": "https://en.wikipedia.org/wiki/Arapaho", "paragraph": "The Arapaho (/əˈræpəhoʊ/; French: Arapahos, Gens de Vache) are a Native American people historically living on the plains of Colorado and Wyoming. They were close allies of the Cheyenne tribe and loosely aligned with the Lakota and Dakota."}, {"url": "https://en.wikipedia.org/wiki/Indian_community_of_London", "paragraph": "British Indians form the largest ethno-national group in London with a population of around 542,857 or 6.6% of the population. The majority are concentrated in West London, though populations can be found throughout London."}, {"url": "https://en.wikipedia.org/wiki/Scottsdale,_Arizona", "paragraph": "Scottsdale is a city in the eastern part of Maricopa County, Arizona, United States, and is part of the Greater Phoenix Area. Named Scottsdale in 1894 after its founder Winfield Scott, a retired U.S. Army chaplain, the city was incorporated in 1951 with a population of 2,000. The 2019 population was estimated at 258,069.[4] Its slogan is \"The West's Most Western Town.\"[5] It has been one of the fastest growing cities in the United States over the past decades."}, {"url": "https://en.wikipedia.org/wiki/Non-resident_Indian_and_person_of_Indian_origin", "paragraph": "Overseas Indians, officially known as Non-Resident Indians (NRIs) or Persons of Indian Origin (PIOs), are people of Indian birth or ancestry who live outside the Republic of India. According to a Ministry of External Affairs report, there are 32 million NRIs and PIOs residing outside India and overseas Indians comprise world's largest overseas diaspora.[1] Every year 2.5 million (25 lakhs) Indians migrate overseas, which is the highest annual number of migrants in the world.[8]"}, {"url": "https://en.wikipedia.org/wiki/Indian_Americans", "paragraph": "Indian Americans or Indo-Americans are citizens of the United States with ancestry from India. The United States Census Bureau uses the term Asian Indian to avoid confusion with Native Americans. With a population of almost four million, Indian Americans make up 1.2% of the U.S. population and are the largest group of South Asian Americans, as well as the second largest group[7] of Asian Americans after Chinese Americans."}, {"url": "https://en.wikipedia.org/wiki/Indian_cuisine", "paragraph": "Indian cuisine consists of a variety of regional and traditional cuisines native to the Indian subcontinent. Given the diversity in soil, climate, culture, ethnic groups, and occupations, these cuisines vary substantially and use locally available spices, herbs, vegetables, and fruits."}, {"url": "https://en.wikipedia.org/wiki/Indian_independence_movement", "paragraph": "The Indian independence movement was a series of historic events with the ultimate aim of ending British rule in India. It lasted from 1857 to 1947.[1]"}, {"url": "https://en.wikipedia.org/wiki/Arikara", "paragraph": "Arikara (English:  /əˈrɪkərə/), also known as Sahnish,[2] Arikaree, Ree, or Hundi, are a tribe of Native Americans in North Dakota. Today, they are enrolled with the Mandan and the Hidatsa as the federally recognized tribe known as the Mandan, Hidatsa, and Arikara Nation."}, {"url": "https://en.wikipedia.org/wiki/List_of_films_based_on_actual_events_(2000%E2%80%93present)", "paragraph": "This is a list of films and miniseries that are based on actual events. All films on this list are from American production unless indicated otherwise."}, {"url": "https://en.wikipedia.org/wiki/List_of_Indian_massacres_in_North_America", "paragraph": "In the history of the European colonization of the Americas, an Indian massacre is any incident between European settlers and indigenous peoples wherein one group killed a significant number of the other group outside the confines of mutual combat in war."}, {"url": "https://en.wikipedia.org/wiki/Indian_Armed_Forces", "paragraph": "The Indian Armed Forces are the military forces of the Republic of India. It consists of three professional uniformed services: the Indian Army, Indian Navy, and Indian Air Force.[12] Additionally, the Indian Armed Forces are supported by the Central Armed Police Forces,[13] Assam Rifles, Indian Coast Guard and Special Frontier Force and various inter-service commands and institutions such as the Strategic Forces Command, the Andaman and Nicobar Command and the Integrated Defence Staff. The President of India is the Supreme Commander of the Indian Armed Forces. The Indian Armed Forces are under the management of the Ministry of Defence (MoD) of the Government of India. With strength of over 1.4 million active personnel,[14][15] it is the world's second-largest military force and has the world's largest volunteer army.[16] It also has the third-largest defence budget in the world.[17] As per 2015 Credit Suisse report, the Indian Armed Forces is the world's fifth-most powerful military,[18] whereas the 2020 GlobalFirepower report lists it as the fourth most-powerful military.[19]"}, {"url": "https://en.wikipedia.org/wiki/Indian_Rebellion_of_1857", "paragraph": "Victoria Earl CanningMaj. Gen. George Anson †Lt. Gen. Sir Patrick GrantGen. Sir Colin Campbell"}, {"url": "https://en.wikipedia.org/wiki/Great_Sioux_Nation", "paragraph": "The Great Sioux Nation is the traditional political structure of the Sioux in North America. The peoples who speak the Sioux language are considered to be members of the Oceti Sakowin (Očhéthi Šakówiŋ, pronounced [oˈtʃʰetʰi ʃaˈkowĩ]) or Seven Council Fires. The seven-member communities are sometimes grouped into three regional/dialect sub-groups (Lakota, Western Dakota, and Eastern Dakota), but these mid-level identities are not politically institutionalized. The seven communities are all individual members of the historic confederacy. In contemporary culture, the designation is primarily a linguistic, cultural, and for some, political grouping. "}, {"url": "https://en.wikipedia.org/wiki/Haskell_Indian_Nations_University", "paragraph": "Haskell Indian Nations University is a public tribal[2] land-grant university in Lawrence, Kansas, United States. Founded in 1884 as a residential boarding school for American Indian children,[3] the school has developed into a university operated by the U.S. Bureau of Indian Affairs[4] that offers both associate and baccalaureate degrees.[5] The college was founded to serve members of federally recognized Native American tribes in the United States. It is the oldest continually operating federal school for American Indians.[6]"}, {"url": "https://en.wikipedia.org/wiki/Algonquin_people", "paragraph": "Algonquin people are an Indigenous people of Eastern Canada. They speak the Algonquin language, a divergent dialect of the Ojibwe language, which is part of the Algonquian language family.[1] Culturally and linguistically, they are closely related to the Odawa, Potawatomi, Ojibwe (including Oji-Cree), and Nipissing, with whom they form the larger Anicinàpe (Anishinaabeg). The Algonquin people call themselves Omàmiwinini (plural: Omàmiwininiwak) or the more generalised name of Anicinàpe."}, {"url": "https://en.wikipedia.org/wiki/Multi-sport_event", "paragraph": "A multi-sport event is an organized sporting event, often held over multiple days, featuring competition in many different sports among organized teams of athletes from (mostly) nation-states. The first major, modern, multi-sport event of international significance was the  Olympic Games, first held in modern times in 1896 in Athens, Greece and inspired by the Ancient Olympic Games, one of a number of such events held in antiquity. Most modern multi-sports events have the same basic structure. Games are held over the course of several days in and around a \"host city\", which changes for each competition. Countries send national teams to each competition, consisting of individual athletes and teams that compete in a wide variety of sports.  Athletes or teams are awarded gold, silver or bronze medals for first, second and third place respectively. Each games are generally held every four years, though some are annual competitions."}, {"url": "https://en.wikipedia.org/wiki/Tennis_Masters_Series_records_and_statistics", "paragraph": "In tennis, the ATP Masters Series is an annual series of nine top-level tournaments featuring the elite men's players on the ATP Tour. The Masters events along with the Grand Slam tournaments and the ATP Finals championship make up the most coveted titles on the ATP tour, they are also known as the \"Big Titles\"."}, {"url": "https://en.wikipedia.org/wiki/Timeline_of_Indian_history", "paragraph": "This is a timeline of Indian history, comprising important legal and territorial changes and political events in India and its predecessor states. To read about the background to these events, see History of India.  See also the list of governors-general of India, list of prime ministers of India and Years in India."}, {"url": "https://en.wikipedia.org/wiki/American_Indian_Wars", "paragraph": "The American Indian Wars, also known as the American Frontier Wars, the First Nations Wars in Canada (French: Guerres des Premières Nations), and the Indian Wars, were fought by European governments and colonists in North America, and later by the United States and Canadian governments and American and Canadian settlers, against various American Indian and First Nation tribes. These conflicts occurred in North America from the time of the earliest colonial settlements in the 17th century until the early 20th century. The various wars resulted from a wide variety of factors. The European powers and their colonies also enlisted allied Indian tribes to help them conduct warfare against each other's colonial settlements. After the American Revolution, many conflicts were local to specific states or regions and frequently involved disputes over land use; some entailed cycles of violent reprisal."}, {"url": "https://en.wikipedia.org/wiki/Indian_rupee", "paragraph": "The Indian rupee (symbol: ₹; code: INR) is the official currency of India. The rupee is subdivided into 100 paise (singular: paisa), though as of 2019, coins of denomination of 1 rupee is the lowest value in use. The issuance of the currency is controlled by the Reserve Bank of India. The Reserve Bank manages currency in India and derives its role in currency management on the basis of the Reserve Bank of India Act, 1934."}, {"url": "https://en.wikipedia.org/wiki/Women_of_the_Indian_independence_movement", "paragraph": "The Indian independence movement was a series of historic events with the ultimate aim of ending British rule in India, lasting from 1857-1947.[1] Women played a pivotal role in achieving India's independence. However, their lives, struggles, and contributions to the movement are never recognized at the same level of prominence as that of the men of the movement. Additionally, their names are seldom heard when discussing the independence movement, or mentioned in brief. Woman’s participation in India’s freedom struggle started as early as 1817. Bhima Bai Holkar fought against the British Colonel Malcolm and defeated him in guerrilla warfare.[2] Throughout the twentieth century, numerous women continued to contribute to the movement through military leadership, political leadership, and social activism."}, {"url": "https://en.wikipedia.org/wiki/Pine_Ridge_Indian_Reservation", "paragraph": "The Pine Ridge Indian Reservation (Lakota: Wazí Aháŋhaŋ Oyáŋke), also called Pine Ridge Agency, is an Oglala Lakota Indian reservation located virtually entirely in the U.S. state of South Dakota. Originally included within the territory of the Great Sioux Reservation, Pine Ridge was created by the Act of March 2, 1889, 25 Stat. 888. in the southwest corner of South Dakota on the Nebraska border. Today it consists of 3,468.85 sq mi (8,984 km2) of land area and is one of the largest reservations in the United States.[4]"}, {"url": "https://en.wikipedia.org/wiki/Steele_Indian_School_Park", "paragraph": "Steele Indian School Park is located on the northeast corner of Indian School Road and Central Avenue in Encanto Village, Phoenix, Arizona.[1]"}, {"url": "https://en.wikipedia.org/wiki/ATP_Tour_Masters_1000", "paragraph": "The ATP Masters 1000 tournaments (previously known as ATP Masters Series) is an annual series of nine tennis tournaments featuring the top-ranked players on the ATP Tour. The series' events have been held in Europe and North America since the debut of ATP Tour in 1990, and also in Asia since 2009. The ATP Masters, along with the ATP Finals, constitute the most coveted trophies in men's tennis after the four majors, and the tournaments are collectively known as the \"Big Titles\" (alongside the Olympics).[1]"}, {"url": "https://en.wikipedia.org/wiki/2022_European_Tour", "paragraph": "The 2022 European Tour, titled as the 2022 DP World Tour for sponsorship reasons,  is the 51st season of golf tournaments since the European Tour officially began in 1972 and the 1st edition of the DP World Tour Rankings. It is the first season of the tour under a title sponsorship agreement with DP World, that was announced in November 2021.[1]"}, {"url": "https://en.wikipedia.org/wiki/Canadian_Indian_residential_school_system", "paragraph": "In Canada, the Indian residential school system[nb 1] was a network of boarding schools for Indigenous peoples.[nb 2] Attendance was mandatory from 1894 to 1947. The network was funded by the Canadian government's Department of Indian Affairs and administered by Christian churches. The school system was created to isolate Indigenous children from the influence of their own native culture and religion in order to assimilate them into the dominant Canadian culture.[3][4][5]: 42 [6] Over the course of the system's more than hundred-year existence, around 150,000 children were placed in residential schools nationally.[7]: 2–3  By the 1930s about 30 percent of Indigenous children were believed to be attending residential schools.[8] The number of school-related deaths remains unknown due to incomplete records. Estimates range from 3,200 to over 30,000.[9][10][11][12]"}, {"url": "https://en.wikipedia.org/wiki/Indo-Canadians", "paragraph": "Indian Canadians are Canadians with ancestry from India. The terms Indo-Canadian or East Indian are sometimes used to avoid confusion with the Indigenous Peoples of Canada. Categorically, Indian Canadians comprise a subgroup of South Asian Canadians which is a further subgroup of Asian Canadians. According to Statistics Canada, Indian Canadians are one of the fastest-growing communities in Canada, making up the second largest non-European group after Chinese Canadians.[2]"}, {"url": "https://en.wikipedia.org/wiki/Big_Cypress_Indian_Reservation", "paragraph": "The Big Cypress Indian Reservation is one of the six reservations of the Seminole Tribe of Florida. It is located in southeastern Hendry County and northwestern Broward County, in southern Florida, United States. Its location is on the Atlantic coastal plain. This reservation lies south of Lake Okeechobee and just north of Alligator Alley. It is governed by the Seminole Tribe of Florida's Tribal Council, and is the largest of the five Seminole reservations in the state. Facilities on the reservation include the tribal museum and a major entertainment and rodeo complex."}, {"url": "https://en.wikipedia.org/wiki/Nik_Dodani", "paragraph": "Nik Dodani (born December 19, 1993) is an American actor, writer, and comedian.[2][3][4] Dodani is known for his roles as Zahid in Atypical, a Netflix original comedy series, and Pat Patel in the revival of popular CBS sitcom Murphy Brown.[5][6]"}, {"url": "https://en.wikipedia.org/wiki/Trail_of_Tears", "paragraph": "The Trail of Tears was part of the Indian removal, an ethnic cleansing and series of forced displacements of approximately 60,000 Native Americans of the Five Civilized Tribes between 1830 and 1850 by the United States government.[3] Removal for this event was gradual, occurring over a period of nearly a decade.[4]  Members of the so-called Five Civilized Tribes—the Cherokee, Muscogee (Creek), Seminole, Chickasaw, and Choctaw nations (including thousands of their black slaves[5])—were forcibly removed from their ancestral homelands in the Southeastern United States to areas to the west of the Mississippi River that had been designated Indian Territory.[3]  The forced relocations were carried out by government authorities after the passage of the Indian Removal Act in 1830.[6] The Cherokee removal in 1838 (the last forced removal east of the Mississippi) was brought on by the discovery of gold near Dahlonega, Georgia, in 1828, resulting in the Georgia Gold Rush.[7]"}, {"url": "https://en.wikipedia.org/wiki/IIT_Kharagpur", "paragraph": "Indian Institute of Technology Kharagpur (IIT Kharagpur) is a public technical university established by the government of India in Kharagpur, West Bengal, India. Established in 1951, the institute is the first of the IITs to be established and is recognised as an Institute of National Importance. In 2019 it was awarded the status of Institute of Eminence by the Government of India.[5]"}, {"url": "https://en.wikipedia.org/wiki/Gurdwara_Darbar_Sahib_Kartarpur", "paragraph": "Gurdwara Darbar Sahib Kartarpur, also called Kartarpur Sahib, is a gurdwara in Kartarpur, located in Shakargarh, Narowal District, in the Punjab province of Pakistan.[1][2] It is built on the historic site where the founder of Sikhism, Guru Nanak, settled and assembled the Sikh community after his missionary travels (udasis to Haridwar, Mecca-Medina, Lanka, Baghdad, Kashmir and Nepal[3][4]) and lived for 18 years until his death in 1539.[5] It is one of the holiest sites in Sikhism, alongside the Golden Temple in Amritsar and Gurdwara Janam Asthan in Nankana Sahib.[6][7]"}, {"url": "https://en.wikipedia.org/wiki/Indian_painting", "paragraph": "Indian painting has a very long tradition and history in Indian art, though because of the climatic conditions very few early examples survive.[1]  The earliest Indian paintings were the rock paintings of prehistoric times, such as the petroglyphs found in places like Bhimbetka rock shelters. Some of the Stone Age rock paintings found among the Bhimbetka rock shelters are approximately 10,000 years old."}, {"url": "https://en.wikipedia.org/wiki/Indian_National_Congress", "paragraph": "(4025 MLAs & 11 Vacant)"}, {"url": "https://en.wikipedia.org/wiki/Sino-Indian_War", "paragraph": "Indian sources:[13][14]1,383 killed1,696 missing548–1,047 wounded3,968 captured"}, {"url": "https://en.wikipedia.org/wiki/India_at_the_2020_Summer_Olympics", "paragraph": "India competed at the 2020 Summer Olympics in Tokyo, Japan. Originally scheduled to take place from 24 July to 9 August 2020, the games were postponed to 23 July to 8 August 2021, due to the COVID-19 pandemic.[3] India has appeared in every edition of the Summer Olympics since 1920, although it made its official debut at the 1900 Summer Olympics in Paris. The nation sent its largest-ever contingent of 126 competitors to the 2020 Games. To date, the 2020 Summer Olympics are the most successful Games for India since its first regular Olympics appearance in 1920,[4][5][6] with Indian Olympians winning 7 medals (1 gold, 2 silver and 4 bronze).[7] The Indian contingent participated in a record 69 events, and earned medals across 18 athletic disciplines.[4][6]"}, {"url": "https://en.wikipedia.org/wiki/National_Historic_Sites_of_Canada", "paragraph": "National Historic Sites of Canada (French: Lieux historiques nationaux du Canada) are places that have been designated by the federal Minister of the Environment on the advice of the Historic Sites and Monuments Board of Canada (HSMBC), as being of national historic significance.[1][2] Parks Canada, a federal agency, manages the National Historic Sites program.  As of July 2021, there were 999 National Historic Sites,[3][4] 172 of which are administered by Parks Canada; the remainder are administered or owned by other levels of government or private entities.[5]  The sites are located across all ten provinces and three territories, with two sites located in France (the Beaumont-Hamel Newfoundland Memorial and Canadian National Vimy Memorial).[6]"}, {"url": "https://en.wikipedia.org/wiki/Lone_Pine,_California", "paragraph": "Lone Pine is a census designated place (CDP) in Inyo County, California, United States.[2] Lone Pine is located 16 miles (26 km) south-southeast of Independence,[3] at an elevation of 3,727 feet (1,136 m).[2]  The population was 2,035 at the 2010 census, up from 1,655 at the 2000 census. The town is located in the Owens Valley, near the Alabama Hills and Mount Whitney, between the eastern peaks of the Sierra Nevada to the west and the Inyo Mountains to the east. The local hospital, Southern Inyo Hospital, offers standby emergency services.[4] The town is named  after a solitary pine tree that once existed at the mouth of Lone Pine Canyon.[5] On March 26, 1872, the very large Lone Pine earthquake destroyed most of the town and killed 27 of its 250 to 300 residents."}, {"url": "https://en.wikipedia.org/wiki/Anand_Bhavan", "paragraph": "The Anand Bhavan is a historic house museum in Prayagraj, India, focusing on the Nehru Family.[1] It was bought by Indian political leader Motilal Nehru in the 1930s to serve as the residence of the Nehru family when the original mansion Swaraj Bhavan (previously called Anand Bhavan) was transformed into the local headquarters of the Indian National Congress.[2] Jawahar Planetarium is situated here, which has been striving to inculcate scientific temper among masses through its sky shows on astronomy and science.[3]"}, {"url": "https://en.wikipedia.org/wiki/Indian_burial_ground_trope", "paragraph": "The Indian burial ground trope is frequently used to explain supernatural events and hauntings in American popular culture.[1] The trope gained popularity in the 1980s, making multiple appearances in horror film and television after its debut in The Amityville Horror (1979). However, in its more recent appearance, the Indian burial ground trope is seen as a cliche and it is commonly used as a satirical element.[1]"}, {"url": "https://en.wikipedia.org/wiki/ATP_Tour_250", "paragraph": "The ATP 250 tournaments (previously known as the ATP World Tour 250 tournaments, ATP International Series, and ATP World Series) are the lowest tier of annual men's tennis tournaments on the main ATP Tour, after the four Grand Slam tournaments, ATP Finals, ATP Tour Masters 1000 tournaments, and ATP 500 tournaments. As of 2020, the series includes 39 tournaments, with 250 ranking points awarded to each singles champion—which accounts for the name of the series. Draws consist of 28, 32, or 48 for singles and 16 for doubles."}, {"url": "https://en.wikipedia.org/wiki/Newspaper_Rock_State_Historic_Monument", "paragraph": "Newspaper Rock State Historic Monument is a Utah state monument featuring a rock panel carved with one of the largest known collections of petroglyphs.[1] It is located in San Juan County, Utah, along Utah State Route 211, 28 miles (45 km) northwest of Monticello and 53 miles (85 km) south of Moab."}, {"url": "https://en.wikipedia.org/wiki/French_and_Indian_War", "paragraph": "The French and Indian War (1754–1763) was a theater of the Seven Years' War, which pitted the North American colonies of the British Empire against those of the French, each side being supported by various Native American tribes. At the start of the war, the French colonies had a population of roughly 60,000 settlers, compared with 2 million in the British colonies.[4] The outnumbered French particularly depended on the natives.[5]"}, {"url": "https://en.wikipedia.org/wiki/Great_Sioux_War_of_1876", "paragraph": "The Great Sioux War of 1876, also known as the Black Hills War, was a series of battles and negotiations that occurred in 1876 and 1877 in an alliance of Lakota Sioux and Northern Cheyenne against the United States. The cause of the war was the desire of the US government to obtain ownership of the Black Hills. Gold had been discovered in the Black Hills, settlers began to encroach onto Native American lands, and the Sioux and the Cheyenne refused to cede ownership. Traditionally, American military and historians place the Lakota at the center of the story, especially because of their numbers, but some Native Americans believe the Cheyenne were the primary target of the American campaign.[5]"}, {"url": "https://en.wikipedia.org/wiki/Carlisle_Indian_Industrial_School", "paragraph": "The United States Indian Industrial School in Carlisle, Pennsylvania, generally known as Carlisle Indian Industrial School, was the flagship Indian boarding school in the United States from 1879 through 1918. It took over the historic Carlisle Barracks, which was transferred to the Department of Interior from the War Department. After the United States entry into World War I, the school was closed and this property was transferred back to the Department of Defense. All the property is now part of the U.S. Army War College."}, {"url": "https://en.wikipedia.org/wiki/Indian_summer", "paragraph": "An Indian summer is a period of unseasonably warm, dry weather that sometimes occurs in autumn in temperate regions of the northern hemisphere. Several references describe a true Indian summer as not occurring until after the first frost, or more specifically the first \"killing\" frost.[1][2][3]"}, {"url": "https://en.wikipedia.org/wiki/Revolutionary_movement_for_Indian_independence", "paragraph": "The Revolutionary movement for Indian Independence was the part of the Indian independence movement comprising the actions of violent underground revolutionary factions. Rash Bihari Bose was called the 'father of Indian revolutionary movement'. Groups believing in armed revolution against the ruling British fall into this category, as opposed to the generally peaceful civil disobedience movement spearheaded by Mohandas Karamchand Gandhi. The revolutionary groups were mainly concentrated in Bengal, Maharashtra, Bihar, the United Provinces and Punjab. More groups were scattered across India."}, {"url": "https://en.wikipedia.org/wiki/Sport_in_India", "paragraph": "Sports in India refers to the large variety of games played in India, ranging from tribal games to more mainstream sports such as field hockey, kabaddi, cricket, badminton and football. India's diversity of culture, people, and tribes are reflected in the wide variety of sporting disciplines in the country."}, {"url": "https://en.wikipedia.org/wiki/American_Indian_boarding_schools", "paragraph": "American Indian boarding schools, also known more recently as American Indian Residential Schools, were established in the United States from the mid 17th to the early 20th centuries with a primary objective of \"civilizing\" or assimilating Native American children and youth into Euro-American culture. In the process, these schools denigrated Native American culture and made children give up their languages and religion.[1] At the same time the schools provided a basic Western education. These boarding schools were first established by Christian missionaries of various denominations. The missionaries were often approved by the federal government to start both missions and schools on reservations,[2] especially in the lightly populated areas of the West. In the late 19th and early 20th centuries especially, the government paid religious orders to provide basic education to Native American children on reservations, and later established its own schools on reservations. The Bureau of Indian Affairs (BIA) also founded additional off-reservation boarding schools based on the assimilation model. These sometimes drew children from a variety of tribes. In addition, religious orders established off-reservation schools."}, {"url": "https://en.wikipedia.org/wiki/Culture_of_India", "paragraph": "Indian culture is the heritage of social norms, ethical values, traditional customs, belief systems, political systems, artifacts and technologies that originated in or are associated with the ethno-linguistically diverse Indian subcontinent. The term also applies beyond India to countries and cultures whose histories are strongly connected to India by immigration, colonization, or influence, particularly in South Asia and Southeast Asia. India's languages, religions, dance, music, architecture, food and customs differ from place to place within the country."}, {"url": "https://en.wikipedia.org/wiki/List_of_last_survivors_of_historical_events", "paragraph": "A historical event can be defined as any occurrence from the past regardless of significance, with the term \"history\" an umbrella term relating to past events and any associated memories, discoveries, collections, organizations, presentations, and/or interpretations of them. This differs from a historic event which is often less inclusive, and stands out as having made a significant impact on history itself.[1]"}, {"url": "https://en.wikipedia.org/wiki/Great_Sioux_Reservation", "paragraph": "The Great Sioux Reservation initially set aside land west of the Missouri River in South Dakota and Nebraska for the use of the Lakota Sioux, who had dominated this territory. The reservation was established in the Fort Laramie Treaty of 1868.[1] It included all of present-day western South Dakota (commonly known as \"West River\" South Dakota) and modern Boyd County, Nebraska.  This area was established by the United States as a reservation for the Teton Sioux, also known as the Lakota: the seven western bands of the \"Seven Council Fires\" (the Great Sioux Nation)."}, {"url": "https://en.wikipedia.org/wiki/Indian_princess", "paragraph": "The Indian princess is usually a stereotypical and grossly inaccurate representation of a Native American or other Indigenous woman of the Americas.[1] The term \"princess\" was often mistakenly applied to the daughters of tribal chiefs or other community leaders by early American colonists who mistakenly believed that Indigenous people shared the European system of royalty.[1] This inaccurate portrayal has continued in popular animation, with characters that conform to European standards of beauty,[2] with the most famous misrepresentation being that of Pocahontas. Frequently, the \"Indian Princess\" stereotype is paired with the \"Pocahontas theme\" in which the princess \"offers herself to a captive Christian knight, a prisoner of her father, and after rescuing him, she is converted to Christianity and live with him in his native land.\"[3] - a false narrative that did not even happen that way to real child who inspired the Pocahontas stories. The phrase \"Indian princess\", when used in this way, is often considered to be a derogatory term, a type of racial slur, and is deemed offensive to Native Americans.[1]"}, {"url": "https://en.wikipedia.org/wiki/Lakota_people", "paragraph": "The Lakota (pronounced [laˈkˣota]; Lakota: Lakȟóta/Lakhóta) are a Native American tribe. Also known as the Teton Sioux (from Thítȟuŋwaŋ), they are one of the three prominent subcultures of the Sioux people. Their current lands are in North and South Dakota. They speak Lakȟótiyapi—the Lakota language, the westernmost of three closely related languages that belong to the Siouan language family."}, {"url": "https://en.wikipedia.org/wiki/List_of_films_based_on_actual_events", "paragraph": "This is a list of films and miniseries that are based on actual events. All films on this list are from American production unless indicated otherwise."}, {"url": "https://en.wikipedia.org/wiki/India", "paragraph": "India, officially the Republic of India (Hindi: Bhārat Gaṇarājya),[24] is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west;[f] China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand, Myanmar and Indonesia."}, {"url": "https://en.wikipedia.org/wiki/India_at_the_Olympics", "paragraph": "India first participated at the Olympic Games in 1900, with a lone athlete Norman Pritchard winning two medals – both silver – in athletics and became the first Asian nation to win an Olympic medal.[1]"}, {"url": "https://en.wikipedia.org/wiki/Indian_Navy_Band", "paragraph": "The Indian Navy Band is the Indian Navy's full time music band. It was established in 1945 and is currently attached to the INS Kunjali. At the time of it commissioning, it had a strength of 50 musicians.[5] All band members have a bachelor's degree from recognized university and can play competently in at least one military sponsored instrument.[6]"}, {"url": "https://en.wikipedia.org/wiki/List_of_states_and_territories_of_the_United_States", "paragraph": "The United States of America is a federal republic[1] consisting of 50 states, a federal district (Washington, D.C., the capital city of the United States), five major territories, and various minor islands.[2][3] The 48 contiguous states and Washington, D.C., are in North America between Canada and Mexico. Alaska is an exclave in the far northwestern part of North America, connected only to Canada, and Hawaii is an archipelago in the mid-Pacific. Territories of the United States are scattered throughout the Pacific Ocean and the Caribbean Sea."}, {"url": "https://en.wikipedia.org/wiki/Indian_astronomy", "paragraph": "Indian astronomy has a long history stretching from pre-historic to modern times. Some of the earliest roots of Indian astronomy can be dated to the period of Indus Valley Civilization or earlier.[1][2] Astronomy later developed as a discipline of Vedanga or one of the \"auxiliary disciplines\" associated with the study of the Vedas,[3] dating 1500 BCE or older.[4] The oldest known text is the Vedanga Jyotisha, dated to 1400–1200 BCE (with the extant form possibly from 700 to 600 BCE).[5]"}, {"url": "https://en.wikipedia.org/wiki/Athletics_in_India", "paragraph": "In India, the sport of athletics was introduced during the period of the British Raj. The sport is governed at national level by the Athletics Federation of India, which was formed in 1946.[1] Despite its large population, at the top level of the sport few Indian athletes have won a medal in a global or major championship. This began to change in the 21st century, when Indians started taking greater interest in athletics more generally and improved facilities for the sport began to be built at a local level. At a continental level, it has been among the more successful Asian nations, though some distance behind China and Japan."}, {"url": "https://en.wikipedia.org/wiki/Crow_people", "paragraph": "The Crow, whose autonym is Apsáalooke ([ə̀ˈpsáːɾòːɡè]), also spelled Absaroka, are Native Americans living primarily in southern Montana. Today, the Crow people have a federally recognized tribe, the Crow Tribe of Montana,[1] with an Indian reservation located in the south-central part of the state.[1]"}, {"url": "https://en.wikipedia.org/wiki/India_men%27s_national_field_hockey_team", "paragraph": "The India men's national field hockey team represents India in international Field hockey competitions, and is governed by Hockey India. The team was formerly under the control of Indian Hockey Federation. India was the first non-European team to be a part of the International Hockey Federation.[2]In 1928, the team won its first Olympic gold medal and until 1960, the Indian men's team remained unbeaten in the Olympics, winning six gold medals in a row. The team had a 30–0 winning streak during this time, from their first game until losing in the 1960 gold medal final. India also won the World Cup in 1975. India's hockey team is the most successful team ever in the Olympics, having won eight gold medals in 1928, 1932, 1936, 1948, 1952, 1956, 1964 and 1980. India also has the best overall performance in Olympic history with 83 victories out of the 134 matches played. They have also scored the most goals in the Olympics than any other team. They are also the only team to ever win the Olympics without conceding a single goal in 1928 and 1956."}, {"url": "https://en.wikipedia.org/wiki/Meskwaki", "paragraph": "The Meskwaki (sometimes spelled Mesquaki), also known by the European exonyms Fox Indians or the Fox, are a Native American people.  They have been closely linked to the Sauk people of the same language family. In the Meskwaki language, the Meskwaki call themselves Meshkwahkihaki, which means \"the Red-Earths\", related to their creation story. Historically their homelands were in the Great Lakes region. The tribe coalesced in the St. Lawrence River Valley in present-day Ontario, Canada. Under French colonial pressures, it migrated to the southern side of the Great Lakes to territory that much later was organized by European Americans as the states of Michigan, Wisconsin, Illinois, and Iowa."}, {"url": "https://en.wikipedia.org/wiki/2021_North_Indian_Ocean_cyclone_season", "paragraph": "The 2021 North Indian Ocean cyclone season was an event in the annual cycle of tropical cyclone formation. The North Indian Ocean cyclone season has no official bounds, but cyclones tend to form between April and December, peaking between May to November. These dates conventionally delimit the period of each year when most tropical cyclones form in the northern Indian Ocean."}, {"url": "https://en.wikipedia.org/wiki/Vidit_Gujrathi", "paragraph": "Vidit Santosh Gujrathi (born 24 October 1994) is an Indian chess player. He attained the title of Grandmaster in January 2013, becoming the 30th player from India to do so. As of August 2021,[update] he is the second highest rated player in India (behind Viswanathan Anand), and is the fourth Indian player to have crossed the Elo rating threshold of 2700."}, {"url": "https://en.wikipedia.org/wiki/2015_North_Indian_Ocean_cyclone_season", "paragraph": "The 2015 North Indian Ocean cyclone season was an event in the annual cycle of tropical cyclone formation. The North Indian Ocean cyclone season has no official bounds, but cyclones tend to form between months of April and December, with the peak from May to November. These dates conventionally delimit the period of each year when most tropical cyclones form in the northern Indian Ocean."}, {"url": "https://en.wikipedia.org/wiki/Vikas_Swarup", "paragraph": "Vikas Swarup (born 22 June 1961)[7] is a retired Indian diplomat and writer. He retired from the Indian Foreign Service as the Secretary (West) at the Ministry of External Affairs, India on 30 June 2021 and has previously served as High Commissioner of India in Canada and has been the official spokesperson of the Ministry of External Affairs of India.[8] He is best known as the author of the novel Q & A, adapted in film as Slumdog Millionaire, the winner of Best Film for the year 2009 at the Academy Awards, Golden Globe Awards and BAFTA Awards."}, {"url": "https://en.wikipedia.org/wiki/Indian_Territory", "paragraph": "The Indian Territory and the Indian Territories are terms that generally described an evolving land area set aside by the United States Government for the relocation of Native Americans who held aboriginal title to their land as a sovereign independent state. In general, the tribes ceded land they occupied in exchange for land grants in 1803. The concept of an Indian Territory was an outcome of the US federal government's 18th- and 19th-century policy of Indian removal. After the American Civil War (1861–1865), the policy of the US government was one of assimilation."}, {"url": "https://en.wikipedia.org/wiki/2020%E2%80%932021_Indian_farmers%27_protest", "paragraph": " Bharatiya Janata Party"}, {"url": "https://en.wikipedia.org/wiki/Vasant_Panchami", "paragraph": "The Hindu calendar is lunisolar but most festival dates are specified using the lunar portion of the calendar. A lunar day is uniquely identified by three calendar elements: māsa (lunar month), pakṣa (lunar fortnight) and tithi (lunar day)."}, {"url": "https://en.wikipedia.org/wiki/List_of_events_named_massacres", "paragraph": "The following is a list of events for which one of the commonly accepted names includes the word \"massacre\".[1]"}, {"url": "https://en.wikipedia.org/wiki/Avani_Lekhara", "paragraph": "Avani Lekhara (born 8 November 2001) is an Indian Paralympian and rifle shooter. She won a gold medal in 10m air rifle standing and a bronze medal in 50m rifle 3 positions at Tokyo 2020 Paralympics.[1] Lekhara is currently World No 2[2] in Women's 10m Air Rifle standing SH1 (World Shooting Para Sport Rankings) and has competed in the 2018 Asian Para Games.[3][4][5][6] She has been supported by GoSports Foundation through the Para Champions Programme.[7] She is also the first Indian woman to win multiple medals in a single Paralympic Games.[8] She has been given out of turn appointment as Assistant Conservator of Forest (ACF) by the Government of Rajasthan.[9]"}, {"url": "https://en.wikipedia.org/wiki/Lucknow_Pact", "paragraph": "The Lucknow Pact was an agreement reached between the Indian National Congress and the Muslim League (AIML) at a joint session of both the parties held in Lucknow in December 1916. Through the pact, the two parties agreed to allow representation to religious minorities in the provincial legislatures. The Muslim League leaders agreed to join the Congress movement demanding Indian autonomy. Scholars cite this as an example of a consociational practice in Indian politics. Bal Gangadhar Tilak represented the Congress while framing the deal, and Muhammad Ali Jinnah (who was part of both Congress and the Muslim League in 1916) and Mahatma Gandhi also participated in this event.[1][2]"}, {"url": "https://en.wikipedia.org/wiki/Kiowa", "paragraph": "Kiowa (/ˈkaɪəwə, -wɑː, -weɪ/[2][3]) people are a Native American tribe and an indigenous people of the Great Plains of the United States. They migrated southward from western Montana into the Rocky Mountains in Colorado in the 17th and 18th centuries,[4] and finally into the Southern Plains by the early 19th century.[5] In 1867, the Kiowa were moved to a reservation in southwestern Oklahoma."}, {"url": "https://en.wikipedia.org/wiki/Rollins_Pass", "paragraph": "Rollins Pass, elevation 11,676 ft (3,559 m), is a mountain pass and active archaeological site[9][10][2] in the Southern Rocky Mountains of north-central Colorado in the United States. The pass is located on and traverses the Continental Divide of the Americas at the crest of the Front Range southwest of Boulder and is located approximately five miles east and opposite the resort in Winter Park—in the general area between Winter Park and Rollinsville. Rollins Pass is at the boundaries of Boulder, Gilpin, and Grand counties. Over the past 10,000 years,[9] the pass provided a route over the Continental Divide between the Atlantic Ocean watershed of South Boulder Creek (in the basin of the South Platte River) with the Pacific Ocean watershed of the Fraser River, a tributary of the Colorado River."}, {"url": "https://en.wikipedia.org/wiki/India_women%27s_national_field_hockey_team", "paragraph": "The Indian women's national field hockey team  (nicknamed the Nabhvarna) represents India in international field hockey, and is governed by Hockey India. Nabhvarna are currently ranked 7th in the FIH World Rankings, and are ranked as the best team in Asia. They have won the gold medals at the 2002 Commonwealth Games and 1982 Asian Games. They have also won the Women's Asia Cup twice, i.e. in 2004 and 2017. They also won the Asian Champions Trophy in 2016. India at the 2020 Summer Olympics,[2] for the first time ever, reached the semi-final in the Women's Hockey Olympic event but failed to bag any medal after they lost to Argentina[3] in the semifinal and then to Great Britain[4] in Bronze medal match."}, {"url": "https://en.wikipedia.org/wiki/Sherman_Indian_High_School", "paragraph": "Sherman Indian High School (SIHS) is an off-reservation boarding high school for Native Americans. Originally opened in 1892 as the Perris Indian School, in Perris, California, the school was relocated to Riverside, California in 1903, under the name Sherman Institute.[2] When the school was accredited by the Western Association of Schools and Colleges[3] in 1971, it became known as Sherman Indian High School."}, {"url": "https://en.wikipedia.org/wiki/Black_Hills_land_claim", "paragraph": "The Black Hills land claim is an ongoing land dispute between Native Americans from the Sioux Nation and the United States government. The land in question was pledged to the Sioux Nation in the Fort Laramie Treaty of April 29, 1868, but a few years later illegally[1] seized and the treaty nullified without the tribe's consent in the Indian Appropriations Bill of 1876. That bill \"denied the Sioux all further appropriation and treaty-guaranteed annuities\" until they gave up the Black Hills.[2] A Supreme Court case was ruled in favor of the Sioux in 1980. The Sioux have outstanding issues with the ruling and have not collected the funds. As of 2011, the award was worth over $1 billion.[3]"}, {"url": "https://en.wikipedia.org/wiki/Ojibwe", "paragraph": "The Ojibwe, Ojibwa, Chippewa, or Saulteaux are an Anishinaabe people in what is currently southern Canada, the northern Midwestern United States, and Northern Plains. "}, {"url": "https://en.wikipedia.org/wiki/Indian_classical_music", "paragraph": "Indian classical music is the classical music of the Indian subcontinent.[1] It has two major traditions: the North Indian classical music known as Hindustani and the South Indian expression known as Carnatic.[2] These traditions were not distinct until about the 15th century. During the period of Mughal rule of the Indian subcontinent, the traditions separated and evolved into distinct forms.  Hindustani music emphasizes improvisation and exploration of all aspects of a raga, while Carnatic performances tend to be short  composition-based.[2] However, the two systems continue to have more common features than differences.[3]"}, {"url": "https://en.wikipedia.org/wiki/Conclusion", "paragraph": "Conclusion may refer to:"}, {"url": "https://en.wikipedia.org/wiki/Calcutta_Cup", "paragraph": "The Calcutta Cup is the trophy awarded to the winner of the rugby match between England and Scotland. It is the oldest of several trophies awarded under the umbrella of the Six Nations Championship, which include the Millennium Trophy, Centenary Quaich, Giuseppe Garibaldi Trophy, Auld Alliance Trophy, the Doddie Weir Cup (the last two were first contested in 2018)."}, {"url": "https://en.wikipedia.org/wiki/List_of_tennis_tournaments", "paragraph": "List of current and past men's and women's tennis tournaments."}, {"url": "https://en.wikipedia.org/wiki/List_of_longest-reigning_monarchs", "paragraph": "This is a list of the longest-reigning monarchs of all time, detailing the monarchs and lifelong leaders who have reigned the longest in world history, sorted by length of reign. Currently reigning monarchs are highlighted in green."}, {"url": "https://en.wikipedia.org/wiki/Wyandot_people", "paragraph": "The Wyandot people or Wendat, also called the Huron,[2][a] [3] are Iroquoian Indigenous peoples of North America who emerged as a confederacy of tribes around the north shore of Lake Ontario, with their original homeland extending to Georgian Bay and Lake Simcoe in Ontario, Canada and occupying some territory around the western part of the lake. "}, {"url": "https://en.wikipedia.org/wiki/Otoe", "paragraph": "The Otoe (Chiwere: Jiwére)[1] are a Native American people of the Midwestern United States. The Otoe language, Chiwere, is part of the Siouan family and closely related to that of the related Iowa, Missouria, and Ho-Chunk tribes."}, {"url": "https://en.wikipedia.org/wiki/Treaty_of_Fort_Laramie_(1851)", "paragraph": "The Fort Laramie Treaty of 1851 was signed on September 17, 1851 between United States treaty commissioners and representatives of the Cheyenne, Sioux, Arapaho, Crow, Assiniboine, Mandan, Hidatsa, and Arikara Nations. The treaty was an agreement between nine more-or-less independent parties. The treaty set forth traditional territorial claims of the tribes as among themselves.[1]"}, {"url": "https://en.wikipedia.org/wiki/Bangalore_Palace", "paragraph": "Bangalore Palace is a royal palace located in Bangalore, Karnataka, India, in an area that was owned by Rev. J. Garrett, the first principal of the Central High School in Bangalore, now famous as Central College. The commencement of the construction of the palace is attributed to him."}, {"url": "https://en.wikipedia.org/wiki/Cheyenne", "paragraph": "The Cheyenne (/ʃaɪˈæn/ shy-AN) are an Indigenous people of the Great Plains. Their Cheyenne language belongs to the Algonquian language family. "}, {"url": "https://en.wikipedia.org/wiki/Plains_Indians", "paragraph": "Plains Indians or Indigenous peoples of the Great Plains and Canadian Prairies are the Native American tribes and First Nation band governments who have historically lived on the Interior Plains (the Great Plains and Canadian Prairies) of North America. While hunting-farming cultures have lived on the Great Plains for centuries prior to European contact, the region is known for the horse cultures that flourished from the 17th century through the late 19th century. Their historic nomadism and armed resistance to domination by the government and military forces of Canada and the United States have made the Plains Indian culture groups an archetype in literature and art for Native Americans everywhere."}, {"url": "https://en.wikipedia.org/wiki/Indian_intervention_in_the_Sri_Lankan_Civil_War", "paragraph": " R. Venkataraman   Rajiv Gandhi   V P Singh  Gen. Krishnaswamy Sundararajan"}, {"url": "https://en.wikipedia.org/wiki/Anti-Indian_sentiment", "paragraph": "Anti-Indian sentiment refers to negative feelings and hatred towards the Republic of India, Indian people, and Indian culture.[1] Indophobia is formally defined in the context of anti-Indian prejudice as \"a tendency to react negatively towards people of Indian extraction against aspects of Indian culture and normative habits\".[2]"}, {"url": "https://en.wikipedia.org/wiki/Contemporary_history", "paragraph": "Contemporary history, in English-language historiography, is a subset of modern history that describes the historical period from approximately 1945 to the present.[1] Contemporary history is either a subset of the late modern period, or it is one of the three major subsets of modern history, alongside the early modern period and the late modern period. The term contemporary history has been in use at least since the early 19th century.[2]"}, {"url": "https://en.wikipedia.org/wiki/Indian_Singaporeans", "paragraph": "Indian Singaporeans are Singaporeans of Indian or South Asian ancestry, who constitute 9.0% of the country's citizens,[1] making them the third largest ancestry and ethnic group in Singapore."}]